Autodesk.Revit.UI.Mechanical.IDuctFittingAndAccessoryPressureDropUIServer.ShowSettings(Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData)
Shows the settings UI.
data:
The input data of the calculation.
Returns:
True if the user makes any changes in the UI, false otherwise.
Since:
2014

Autodesk.Revit.UI.Mechanical.IDuctFittingAndAccessoryPressureDropUIServer.GetDBServerId
Returns the Id of the corresponding DB server for which this server provides an optional UI.
Remarks:
Note that there may be only one UI server assigned to a DB calculation server.
Returns:
The Id of the DB server.
Since:
2014

Autodesk.Revit.UI.Mechanical.IDuctFittingAndAccessoryPressureDropUIServer
Interface for external servers providing optional UI for duct fitting and duct accessory coefficient calculation.
Remarks:
This service works with duct fitting and accessory pressure drop service. It provides the settings for the duct fitting and accessory pressure drop server if needed;
and it also provides UI for user to input the settings in Revit.
A typical way to use the external server can be:
Implement a server class that derives from this interface Create a new server object and register it with the service.
Since:
2014